//자바스크립트 출력 실습(첫 실습)
console.log("Hello World")
//연산자 실습 내용
console.log(1+2);
console.log(1-2);
console.log(1/2);
console.log(5.0 % 2.2);

//이스케이프 문자 실습 내용
console.log('이름\t나이');  // 수평 탭 사용
console.log('이름\n나이');  // 줄 바꿈 사용
console.log('이름\\\\나이'); // 역슬래시 사용

//실습 결과 확인 법
/*
vs code에서 코드를 작성한 후 본인이 원하는 디렉토리에 저장한다
인터넷에서 node.js를 설치한 다음 실행해야 동작하기 때문에, 설치를 반드시 한다.
설치를 마무리 하였다면, 내가 작성한 소스코드 파일이 들어 있는 디렉토리 안에 들어가서 마우스 우클릭을 실시한다!
'터미널에서 열기'를 클릭하면, 이상한 검은 창이 뜰 것이다. 이건 windows powershell이라고 부르는 창이다.
시간이 조금 지나면, 커서(>)가 등장하게 되는데, 거기에다가 'node (파일명)' 을 입력하면 동작 결과를 볼 수 있다!
파일명에서 확장자는 적을 필요가 없다
그리고, 반드시 소스코드 파일을 ctri+s 하여서 저장한 다음 실시해야 원하는 결과를 볼 수 있으니까 주의하자!!! (Happy coding!)
*/
